Trabajo-Extra/T13-ManzanoN-EscalonaI-EmbarkS-anexo/resultados/ab_docker_20250607_224654.log
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        29 bytes

Concurrency Level:      10
Time taken for tests:   0.093 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      38600 bytes
HTML transferred:       2900 bytes
Requests per second:    1070.34 [#/sec] (mean)
Time per request:       9.343 [ms] (mean)
Time per request:       0.934 [ms] (mean, across all concurrent requests)
Transfer rate:          403.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     4    8   1.2      8      11
Waiting:        3    8   1.2      8      11
Total:          4    9   1.2      9      11

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%      9
  80%      9
  90%     10
  95%     11
  98%     11
  99%     11
 100%     11 (longest request)