Trabajo-Extra/T13-ManzanoN-EscalonaI-EmbarkS-anexo/resultados/ab_kubernetes_20250607_224654.log
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        Apache/2.4.62
Server Hostname:        127.0.0.1
Server Port:            54433

Document Path:          /
Document Length:        29 bytes

Concurrency Level:      10
Time taken for tests:   0.215 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      39600 bytes
HTML transferred:       2900 bytes
Requests per second:    464.51 [#/sec] (mean)
Time per request:       21.528 [ms] (mean)
Time per request:       2.153 [ms] (mean, across all concurrent requests)
Transfer rate:          179.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.2      0       1
Processing:     5   19  15.7     10      48
Waiting:        5   17  15.1     10      48
Total:          6   19  15.7     11      49
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     39
  80%     41
  90%     48
  95%     49
  98%     49
  99%     49
 100%     49 (longest request)